InformationRegisters/ПредметыКонтролируемыхСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПредметыКонтролируемыхСделок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯвляетсяТоваромМировойБиржевойТорговли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОблагаетсяНДПИПоПроцентнойСтавке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПредметСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПредметыКонтролируемыхСделок/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	ДоступностьКлючевыхЗаписей = Истина;
	Если Параметры.Свойство("ДоступностьКлючевыхЗаписей") Тогда
		ДоступностьКлючевыхЗаписей = Параметры.ДоступностьКлючевыхЗаписей;
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПредметСделки.ТолькоПросмотр 							= НЕ ДоступностьКлючевыхЗаписей;
	ЭтаФорма.Элементы.ЯвляетсяТоваромМировойБиржевойТорговли.ТолькоПросмотр = НЕ ДоступностьКлючевыхЗаписей;
	
	ОтметкаЗаполнения = ДоступностьКлючевыхЗаписей И НЕ ЗначениеЗаполнено(Запись.КодПоОКВЭД) И НЕ ЗначениеЗаполнено(Запись.КодПоОКП)
		И НЕ ЗначениеЗаполнено(Запись.КодПоТНВЭД) И НЕ ЗначениеЗаполнено(Запись.КодПоОКВЭД2) И НЕ ЗначениеЗаполнено(Запись.КодПоОКПД2);
	
	ЭтаФорма.Элементы.КодПоОквэд.АвтоОтметкаНезаполненного  = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКП.АвтоОтметкаНезаполненного    = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоТНВЭД.АвтоОтметкаНезаполненного  = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКПД2.АвтоОтметкаНезаполненного  = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКВЭД2.АвтоОтметкаНезаполненного = ОтметкаЗаполнения;
	
КонецПроцедуры
